---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ViewExportingEventArgs
source: html/42fa85d3-6365-a3ca-d2ec-1eef1f4cce53.htm
---
# ViewExportingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.